tests/twoPorousWalls/Allrun
#!/bin/sh
blockMesh
NMACFoam
